using DiplomToyStore.Models;
using Microsoft.AspNetCore.Identity;
using Microsoft.EntityFrameworkCore;
using Microsoft.Extensions.Configuration;
using Microsoft.Extensions.DependencyInjection;
using System;
using System.Linq;
using System.Threading.Tasks;

namespace DiplomToyStore.Data
{
    public static class Seeder
    {
        public static async Task CreateAdminAccount(
            IServiceProvider serviceProvider, IConfiguration configuration)
        {
            var userManager = serviceProvider.GetRequiredService<UserManager<ApplicationUser>>();
            var roleManager = serviceProvider.GetRequiredService<RoleManager<IdentityRole>>();

            var user = new ApplicationUser
            {
                Email = configuration["Data:AdminUser:Email"],
                FirstName = configuration["Data:AdminUser:FirstName"],
                LastName = configuration["Data:AdminUser:LastName"],
                UserName = configuration["Data:AdminUser:UserName"],
                EmailConfirmed = true
            };
            var password = configuration["Data:AdminUser:Password"];
            var role = configuration["Data:AdminUser:Role"];

            if (await userManager.FindByEmailAsync(user.UserName) == null)
            {
                if (await roleManager.FindByNameAsync(role) == null)
                {
                    await roleManager.CreateAsync(new IdentityRole(role));
                }

                var result = await userManager.CreateAsync(user, password);
                if (result.Succeeded)
                {
                    await userManager.AddToRoleAsync(user, role);
                }
            }
        }

        public static void SeedData(IServiceProvider serviceProvider)
        {
            var context = serviceProvider.GetRequiredService<AppDbContext>();
            context.Database.Migrate();
            //якщо немає продуктів - додаємо дефолтні
            if (!context.Products.Any())
            {
                context.Products.AddRange(
                    new Product
                    {
                        Name = "БРЯЗКАЛЬЦЕ МЯКА В РУЧКУ FISHER PRICE GH73133 (48ШТ) ЖИРАФ, НА ЗРУЧНОМУ КІЛЬЦІ З КУЛЬКАМИ ВНУТРИ9*13",
                        Description = "Вона виконана з мякого, міцного матеріалу в яскравих райдужних кольорах. Крім мякої частини у брязкальця є невелика прозора ручка з пластмаси, всередині якої знаходяться маленькі кульки. Якщо потрясти іграшку, то вона буде гриміти. Такі звуки привертають увагу малюка і заспокоюють його.",
                        Price = 183.47M,
                        Count = 24
                    },
                    new Product
                    {
                        Name = "БРЯЗКАЛЬЦЕ МЯКА В РУЧКУ FISHER PRICE GH73100(48ШТ) ЖИРАФ, ВСЕРЕДИНІ ПИЩАЛКА 9*28 СМ, НА ПЛАНШЕТКЕ19",
                        Description = "Це нова іграшка Fisher Price, розроблена спеціально для малюків. Вона зроблена з мякого матеріалу в яскравих кольорах, в забарвлює склад додані харчові барвники. Завдяки цьому іграшка безпечна для дитини в самому ранньому віці. Всередині знаходиться елемент, який пищить при натисканні. Знизу доповнена елементом-прорезивателей, за допомогою якого можна чесати ясна, коли зявляються зубки. Розвиває слух, уважність, дрібну моторику і зір. Рекомендується дітям від 0 місяців.",
                        Price = 165.33M,
                        Count = 9
                    },
                     new Product
                     {
                         Name = "БРЯЗКАЛЬЦЕ МЯКА В РУЧКУ FISHER PRICE GH73092(48ШТ) ЛИСЕНЯ,ВСЕРЕДИНІ ПИЩАЛКА 9 * 28 СМ,НА ПЛАНШЕТКЕ1",
                         Description = "Це нова іграшка Fisher Price, розроблена спеціально для малюків. Вона зроблена з мякого матеріалу в яскравих кольорах, в забарвлює склад додані харчові барвники. Завдяки цьому іграшка безпечна для дитини в самому ранньому віці. Всередині знаходиться елемент, який пищить при натисканні. Знизу доповнена елементом-прорезивателей, за допомогою якого можна чесати ясна, коли зявляються зубки. Розвиває слух, уважність, дрібну моторику і зір. Рекомендується дітям від 0 місяців.",
                         Price = 165.33M,
                         Count = 15
                     },
                     new Product
                     {
                         Name = "БРЯЗКАЛЬЦЕ МЯКА В РУЧКУ FISHER PRICE GH73097(48ШТ) ЛЕВЕНЯ,ВСЕРЕДИНІ ПИЩАЛКА 9 * 28 СМ,НА ПЛАНШЕТЦІ",
                         Description = "Це нова іграшка Fisher Price, розроблена спеціально для малюків. Вона зроблена з мякого матеріалу в яскравих кольорах, в забарвлює склад додані харчові барвники. Завдяки цьому іграшка безпечна для дитини в самому ранньому віці. Всередині знаходиться елемент, який пищить при натисканні. Знизу доповнена елементом-прорезивателей, за допомогою якого можна чесати ясна, коли зявляються зубки. Розвиває слух, уважність, дрібну моторику і зір. Рекомендується дітям від 0 місяців.",
                         Price = 165.33M,
                         Count = 20
                     },
                     new Product
                     {
                         Name = "БРЯЗКАЛЬЦЕ МЯКА В РУЧКУ FISHER PRICE GH73151(36ШТ) ЛИСЕНЯ,ПИЩАЛКА,НА ПЛАНШЕТЦІ",
                         Description = "Це нова іграшка Fisher Price, розроблена спеціально для малюків. Вона зроблена з мякого матеріалу в яскравих кольорах, в забарвлює склад додані харчові барвники. Завдяки цьому іграшка безпечна для дитини в самому ранньому віці. Всередині знаходиться елемент, який пищить при натисканні. Знизу доповнена елементом-прорезивателей, за допомогою якого можна чесати ясна, коли зявляються зубки. Розвиває слух, уважність, дрібну моторику і зір. Рекомендується дітям від 0 місяців.",
                         Price = 138.53M,
                         Count = 100
                     },
                     new Product
                     {
                         Name = "БРЯЗКАЛЬЦЕ МЯКА В РУЧКУ FISHER PRICE GH62806(36ШТ)СЛОНЕНЯ,ВСЕРЕДИНІ ПИЩАЛКА 15 * 9 СМ,НА ПЛАНШЕТКЕ1",
                         Description = "Це нова іграшка Fisher Price, розроблена спеціально для малюків. Вона зроблена з мякого матеріалу в яскравих кольорах, в забарвлює склад додані харчові барвники. Завдяки цьому іграшка безпечна для дитини в самому ранньому віці. Всередині знаходиться елемент, який пищить при натисканні. Знизу доповнена елементом-прорезивателей, за допомогою якого можна чесати ясна, коли зявляються зубки. Розвиває слух, уважність, дрібну моторику і зір. Рекомендується дітям від 0 місяців.",
                         Price = 138.53M,
                         Count = 22
                     },
                     new Product
                     {
                         Name = "БРЯЗКАЛЬЦЕ МЯКА В РУЧКУ FISHER PRICE GH73131(48ШТ) ЛЕВЕНЯ,НА ЗРУЧНОМУ КІЛЬЦІ З КУЛЬКАМИ ВНУТРИ9 * 1",
                         Description = "Вона виконана з мякого, міцного матеріалу в яскравих райдужних кольорах. Крім мякої частини у брязкальця є невелика прозора ручка з пластмаси, всередині якої знаходяться маленькі кульки. Якщо потрясти іграшку, то вона буде гриміти. Такі звуки привертають увагу малюка і заспокоюють його. Розвиває тактильне і слухове сприйняття, дрібну моторику, увагу.",
                         Price = 183.47M,
                         Count = 100
                     },
                     new Product
                     {
                         Name = "БРЯЗКАЛЬЦЕ МЯКА В РУЧКУ FISHER PRICE GH73132(48ШТ) ЛИСЕНЯ,НА ЗРУЧНОМУ КІЛЬЦІ З КУЛЬКАМИ ВНУТРИ9 * 1",
                         Description = "Вона виконана з мякого, міцного матеріалу в яскравих райдужних кольорах. Крім мякої частини у брязкальця є невелика прозора ручка з пластмаси, всередині якої знаходяться маленькі кульки. Якщо потрясти іграшку, то вона буде гриміти. Такі звуки привертають увагу малюка і заспокоюють його. Розвиває тактильне і слухове сприйняття, дрібну моторику, увагу.",
                         Price = 183.88M,
                         Count = 100
                     },
                     new Product
                     {
                         Name = "БРЯЗКАЛЬЦЕ МЯКА В РУЧКУ FISHER PRICE GH73149(36ШТ) ЖИРАФ,ВСЕРЕДИНІ ПИЩАЛКА 15 * 9 СМ,НА ПЛАНШЕТКЕ19 * ",
                         Description = "Це новинка Fisher Price, розроблена спеціально для малюків. Вона зроблена з мякого матеріалу в яскравих кольорах, в забарвлює склад додані харчові барвники. Завдяки цьому брязкальце безпечна для дитини в самому ранньому віці. Всередині знаходиться елемент, який пищить при натисканні. Розвиває слух, уважність, дрібну моторику і зір. Рекомендується дітям від 0 місяців.",
                         Price = 138.53M,
                         Count = 20
                     },
                     new Product
                     {
                         Name = "БРЯЗКАЛЬЦЕ МЯКА В РУЧКУ FISHER PRICE GH73150(36ШТ) ЛЕВЕНЯ ВСЕРЕДИНІ ПИЩАЛКА 15 * 9 СМ, НА ПЛАНШЕТКЕ1",
                         Description = "Це новинка Fisher Price, розроблена спеціально для малюків. Вона зроблена з мякого матеріалу в яскравих кольорах, в забарвлює склад додані харчові барвники. Завдяки цьому брязкальце безпечна для дитини в самому ранньому віці. Всередині знаходиться елемент, який пищить при натисканні. Розвиває слух, уважність, дрібну моторику і зір. Рекомендується дітям від 0 місяців.",
                         Price = 138.53M,
                         Count = 100
                     },
                     new Product
                     {
                         Name = "БРЯЗКАЛЬЦЕ-БРАСЛЕТ МЯКИЙ FISHER PRICE GH73099(120ШТ) ЛЬВЕНОК5 * 13СМ,НА ПЛАНШЕТКЕ19 * 13,5 СМ,В ІНДІВ",
                         Description = "Браслет на ручку є оригінальною розвиваючою іграшкою Fisher Price. Іграшка виконана з мякого текстильного матеріалу, пофарбована в яскраві кольори і не викликає алергії у дитини. Зроблена у вигляді широкого браслета з мордочкою лева, який можна повязати на руку дитини або прикріпити до перекладині ліжечка, коляски, в будь-якому іншому місці. Застібається на мяку зручну липучку. Завдяки цьому іграшка не загубиться, не впаде на підлогу і не забрудниться. Розвиває дрібну моторику, сенсорне і тактильне сприйняття.",
                         Price = 115.04M,
                         Count = 100
                     },
                     new Product
                     {
                         Name = "БРЯЗКАЛЬЦЕ-БРАСЛЕТ МЯКИЙ FISHER PRICE GH62743(120ШТ)ПАНДА 5 * 13СМ,НА ПЛАНШЕТКЕ19 * 13,5 СМ,В ІНДИВІДУ",
                         Description = "Браслет на ручку є оригінальною розвиваючою іграшкою Fisher Price. Іграшка виконана з мякого текстильного матеріалу, пофарбована в яскраві кольори і не викликає алергії у дитини. Зроблена у вигляді широкого браслета з мордочкою лева, який можна повязати на руку дитини або прикріпити до перекладині ліжечка, коляски, в будь-якому іншому місці. Застібається на мяку зручну липучку. Завдяки цьому іграшка не загубиться, не впаде на підлогу і не забрудниться. Розвиває дрібну моторику, сенсорне і тактильне сприйняття.",
                         Price = 115.04M,
                         Count = 100
                     }
                    );

                context.SaveChanges();
            }
        }

    }
}
